app/controllers/api/v1/products_controller.rb

INSERT INTO "products" ("title", "price", "published", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "MyString"], ["price", 9.99], ["published", 0], ["user_id", 980190962], ["created_at", "2019-11-22 22:16:06.432364"], ["updated_at", "2019-11-22 22:16:06.432364"]]
---
  def create
    product = current_user.products.build(product_params)
    if product.save